
# https://drive.google.com/file/d/1FkjLKWr7Fy1a6pGCrCUzFSecrArwqxha/view?usp=sharing
# 001 - 1
# 010 - 2
# 011 - 3
# 100 - 4
# 101 - 5
# 110 - 6
# 111 - 7
# задаем переменные
a = 5
b = 6
# переводим в 2-е представление
print(f"{a} = {bin(a)}")
print(f"{b} = {bin(b)}")

# выполняем логические побитовые операции
print(f"{a} & {b} = {a & b} ({bin(a&b)})")   # логическое И (1-1->1, 0-1->0, 1-0->0, 0-0->0)
print(f"{a} | {b} = {a | b} ({bin(a|b)})")      # логическое ИЛИ (0-0->0, 1-0->1, 0-1->1, 1-1->1)
print(f"{a} ^ {b} = {a ^ b} ({bin(a^b)})")      # логическое исключающее ИЛИ (0-0->0, 1-1->0, 1-0->1, 0-1->1)

print("%d >> 2 = %d (%s)" % (a, a >> 2, bin(a >> 2)))   # побитовый сдвиг вправо 101 >>2  = 001 ( 1 в 10 системе)
print("%d << 2 = %d (%s)" % (a, a << 2, bin(a << 2)))   # побитовый сдвиг влево 101 <<2 = 10100 (20 в 10 системе)
