# -*-coding:utf8-*-

# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий
# набор натуральных чисел. У пользователя необходимо запрашивать новый элемент
# рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то
# новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

my_list = [7, 5, 3, 3, 2]
print('Начало: ', my_list)

while(True):
    num = int(input('Введите номер: '))

    if((num in my_list) == True):
        print('Есть в списке под номером', my_list.index(num))
        my_list.reverse()
        my_list.insert(my_list.index(num), num)
        my_list.reverse()
        print(my_list)
    else:
        my_list.append(num);
        my_list.reverse()
        my_list.sort()
        my_list.reverse()
        print(my_list)

    if(len(my_list) >= 12):
        break
